qmk/qmk_firmware/tmk_core/protocol/arm_atsam/usb/udi_hid_kbd.c
    if (udi_hid_kbd_b_report_trans_ongoing) {
        return false;
    }

    memcpy(udi_hid_kbd_report_trans, udi_hid_kbd_report, UDI_HID_KBD_REPORT_SIZE);
    udi_hid_kbd_b_report_valid = false;
    udi_hid_kbd_b_report_trans_ongoing =
            udd_ep_run(UDI_HID_KBD_EP_IN | USB_EP_DIR_IN,
                        false,
                        udi_hid_kbd_report_trans,
                        UDI_HID_KBD_REPORT_SIZE,
                        udi_hid_kbd_report_sent);

    return udi_hid_kbd_b_report_trans_ongoing;
}

static void udi_hid_kbd_report_sent(udd_ep_status_t status, iram_size_t nb_sent, udd_ep_id_t ep)
{
    UNUSED(status);
    UNUSED(nb_sent);
    UNUSED(ep);
    udi_hid_kbd_b_report_trans_ongoing = false;
    if (udi_hid_kbd_b_report_valid) {
        udi_hid_kbd_send_report();
    }
}

static void udi_hid_kbd_setreport_valid(void)
{
    //UDI_HID_KBD_CHANGE_LED(udi_hid_kbd_report_set);
}

#endif //KBD

//********************************************************************************************
// NKRO Keyboard
//********************************************************************************************
#ifdef NKRO

bool udi_hid_nkro_enable(void);
void udi_hid_nkro_disable(void);
bool udi_hid_nkro_setup(void);
uint8_t udi_hid_nkro_getsetting(void);

UDC_DESC_STORAGE udi_api_t udi_api_hid_nkro = {
    .enable = (bool(*)(void))udi_hid_nkro_enable,
    .disable = (void (*)(void))udi_hid_nkro_disable,
    .setup = (bool(*)(void))udi_hid_nkro_setup,
    .getsetting = (uint8_t(*)(void))udi_hid_nkro_getsetting,
    .sof_notify = NULL,
};

COMPILER_WORD_ALIGNED
static uint8_t udi_hid_nkro_rate;

COMPILER_WORD_ALIGNED
static uint8_t udi_hid_nkro_protocol;

COMPILER_WORD_ALIGNED
uint8_t udi_hid_nkro_report_set;

bool udi_hid_nkro_b_report_valid;

COMPILER_WORD_ALIGNED
uint8_t udi_hid_nkro_report[UDI_HID_NKRO_REPORT_SIZE];

volatile bool udi_hid_nkro_b_report_trans_ongoing;

COMPILER_WORD_ALIGNED
static uint8_t udi_hid_nkro_report_trans[UDI_HID_NKRO_REPORT_SIZE];

COMPILER_WORD_ALIGNED
UDC_DESC_STORAGE udi_hid_nkro_report_desc_t udi_hid_nkro_report_desc = {
    {
        0x05, 0x01,     // Usage Page (Generic Desktop),
        0x09, 0x06,     // Usage (Keyboard),
        0xA1, 0x01,     // Collection (Application) - Keyboard,

        //Mods
        0x75, 0x01,     //   Report Size (1),
        0x95, 0x08,     //   Report Count (8),
        0x15, 0x00,     //   Logical Minimum (0),
        0x25, 0x01,     //   Logical Maximum (1),
        0x05, 0x07,     //   Usage Page (Key Codes),
        0x19, 0xE0,     //   Usage Minimum (224),
        0x29, 0xE7,     //   Usage Maximum (231),
        0x81, 0x02,     //   Input (Data, Variable, Absolute),

        //LED Report
        0x75, 0x01,     //   Report Size (1),
        0x95, 0x05,     //   Report Count (5),
        0x05, 0x08,     //   Usage Page (LEDs),
        0x19, 0x01,     //   Usage Minimum (1),
        0x29, 0x05,     //   Usage Maximum (5),
        0x91, 0x02,     //   Output (Data, Variable, Absolute),

        //LED Report Padding
        0x75, 0x03,     //   Report Size (3),
        0x95, 0x01,     //   Report Count (1),
        0x91, 0x03,     //   Output (Constant),

        //Main keys
        0x75, 0x01,     //   Report Size (1),
        0x95, 0xF8,     //   Report Count (248),
        0x15, 0x00,     //   Logical Minimum (0),
        0x25, 0x01,     //   Logical Maximum (1),
        0x05, 0x07,     //   Usage Page (Key Codes),
        0x19, 0x00,     //   Usage Minimum (0),
        0x29, 0xF7,     //   Usage Maximum (247),
        0x81, 0x02,     //   Input (Data, Variable, Absolute, Bitfield),
        0xc0,           // End Collection - Keyboard
    }
};

static bool udi_hid_nkro_setreport(void);
static void udi_hid_nkro_setreport_valid(void);
static void udi_hid_nkro_report_sent(udd_ep_status_t status, iram_size_t nb_sent, udd_ep_id_t ep);

bool udi_hid_nkro_enable(void)
{
    // Initialize internal values
    udi_hid_nkro_rate = 0;
    udi_hid_nkro_protocol = 0;
    udi_hid_nkro_b_report_trans_ongoing = false;
    memset(udi_hid_nkro_report, 0, UDI_HID_NKRO_REPORT_SIZE);
    udi_hid_nkro_b_report_valid = false;
    return UDI_HID_NKRO_ENABLE_EXT();
}

void udi_hid_nkro_disable(void)
{
    UDI_HID_NKRO_DISABLE_EXT();
}

bool udi_hid_nkro_setup(void)
{
    return udi_hid_setup(&udi_hid_nkro_rate,
                            &udi_hid_nkro_protocol,
                            (uint8_t *) &udi_hid_nkro_report_desc,
                            udi_hid_nkro_setreport);
}

uint8_t udi_hid_nkro_getsetting(void)
{
    return 0;
}

//keyboard receives LED report here
static bool udi_hid_nkro_setreport(void)
{
    if ((USB_HID_REPORT_TYPE_OUTPUT == (udd_g_ctrlreq.req.wValue >> 8))
        && (0 == (0xFF & udd_g_ctrlreq.req.wValue))
        && (1 == udd_g_ctrlreq.req.wLength)) {
        // Report OUT type on report ID 0 from USB Host
        udd_g_ctrlreq.payload = &udi_hid_nkro_report_set;
        udd_g_ctrlreq.callback = udi_hid_nkro_setreport_valid; //must call routine to transform setreport to LED state
        udd_g_ctrlreq.payload_size = 1;
        return true;
    }
    return false;
}

bool udi_hid_nkro_send_report(void)
{
    if (!main_b_nkro_enable) {
        return false;
    }

    if (udi_hid_nkro_b_report_trans_ongoing) {
        return false;
    }

    memcpy(udi_hid_nkro_report_trans, udi_hid_nkro_report, UDI_HID_NKRO_REPORT_SIZE);
    udi_hid_nkro_b_report_valid = false;
    udi_hid_nkro_b_report_trans_ongoing =
            udd_ep_run(UDI_HID_NKRO_EP_IN | USB_EP_DIR_IN,
                        false,
                        udi_hid_nkro_report_trans,
                        UDI_HID_NKRO_REPORT_SIZE,
                        udi_hid_nkro_report_sent);

    return udi_hid_nkro_b_report_trans_ongoing;
}

static void udi_hid_nkro_report_sent(udd_ep_status_t status, iram_size_t nb_sent, udd_ep_id_t ep)
{
    UNUSED(status);
    UNUSED(nb_sent);
    UNUSED(ep);
    udi_hid_nkro_b_report_trans_ongoing = false;
    if (udi_hid_nkro_b_report_valid) {
        udi_hid_nkro_send_report();
    }
}

static void udi_hid_nkro_setreport_valid(void)
{
    //UDI_HID_NKRO_CHANGE_LED(udi_hid_nkro_report_set);
}

